Revit 2027 API
FillPattern.LengthPerArea Property
 Gets length of all lines that placed on unit area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LengthPerArea { get; }
Public ReadOnly Property LengthPerArea As Double
	Get
public:
property double LengthPerArea {
	double get ();
}
member LengthPerArea : float with get
Property Value
Double
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace